{
  "code": "eie414",
  "topics": [
    {
      "topic": "ELECTRICAL INSTALLATION:  Safety Principles, Electrical Safety & First Aid",
      "details": "\n      \n      <p class=''>An <span class=\"highlight uppercase\">electrical installation</span> is a system of electrical equipment that is used to provide electricity to a building or structure. It includes the main electrical panel, wiring, outlets, and other electrical components that are used to distribute electricity throughout the building.</p> \n      \n      <h2 class=\"segueing\">Faults in Domestic Systems</h2>\n \n        <li><span class=\"highlight\">Short circuit faults </span>are electrical faults that occur when a low-resistance connection is made between two points in an electrical circuit, resulting in a sudden and unintended flow of current. Short circuits can cause a wide range of problems, including overheating, electrical fires, and damage to electrical equipment.</li>\n  \n        <li><span class=\"highlight\">Insulation failure </span>refers to the breakdown or degradation of the insulation material surrounding electrical wires, cables, or other conductive elements. Insulation is used to protect people and equipment from electrical shock and to prevent the risk of electrical fires. When insulation fails, it can allow electrical current to escape, which can cause electrical shocks, fires, or damage to electrical equipment.</li>\n        <h2 class=\"segueing\">Reasons for protection</h2>\n\n        <li><span class=\"highlight\">Safety:</span> To prevent electrical shocks and fires</li>\n        <li><span class=\"highlight\">Reliability: </span>To prevent damage and ensure continuous operation</li>\n        <li><span class=\"highlight\">Cost savings: </span>To prevent repair and replacement costs</li>\n        <li><span class=\"highlight\">Energy efficiency: </span>To prevent electrical surges and ensure equipment operates efficiently</li>\n        <li><span class=\"highlight\">Compliance with regulations: </span>To ensure systems and equipment meet safety and reliability standards</li>\n\n        <h2 class=\"segueing\">Protective equipment features</h2>\n\n        <li>Certainty and reliability of operation under fault conditions and non-operation under normal conditions</li>\n        <li>Discrimination</li>\n        <li>Rapidity of operation</li>\n        <li>Simplicity, low initial and maintenance cost</li>\n        <li>Easy adjustment and testing</li>\n\n        Overall, protective equipment that possesses these features can help to ensure the safety and reliability of electrical systems and protect against excess currents and earth leakage.\n\n       <div class=\"accordion\">\n            <span class=\"accordion-header\">More Details &#8659; </span>\n            <div class=\"accordion-content\">\n                <li><span class=\"highlight\">Certainty and reliability of operation under fault conditions and\n                        non-operation under normal\n                        conditions:</span> Protective equipment should be designed to operate correctly and consistently\n                    when it is\n                    needed, but should not interfere with the normal operation of the electrical system.</li>\n                <li> <span class=\"highlight\">Discrimination: </span>Protective equipment should be able to differentiate\n                    between normal\n                    and fault conditions, so that it only operates when it is needed.</li>\n                <li><span class=\"highlight\">Rapidity of operation: </span>Protective equipment should be able to respond\n                    quickly to\n                    fault conditions, in order to minimize the risk of injury or damage.</li>\n                <li><span class=\"highlight\">Simplicity, low initial and maintenance cost:</span> Protective equipment\n                    should be easy to\n                    use and maintain, and should not be too expensive to purchase or operate.</li>\n                <li><span class=\"highlight\">Easy adjustment and testing:</span> Protective equipment should be easy to\n                    adjust and test,\n                    so that it can be properly maintained and calibrated to ensure that it is operating correctly.</li>\n            </div>\n        </div>\n\n        <div>\n            <h2 class=\"segueing\">Methods of protection</h2>\n            <li>Fuses and circuit breakers</li>\n            <li>Earthing or grounding</li>\n            <li>Earth leakage and residual current circuit breakers (RCCBs)</li>\n            These are some of the most popular methods of protection used to protect against electrical hazards. It is\n            important to\n            use appropriate protective measures to ensure the safety of electrical systems and prevent accidents.\n            <div class=\"accordion\">\n                <span class=\"accordion-header\">More Details &#8659; </span>\n                <div class=\"accordion-content\">\n                    <li><span class=\"highlight\">Earthing or grounding:</span> of equipment is a method of protection\n                        that\n                        involves connecting electrical equipment to the earth\n                        or ground. This helps to dissipate excess electrical current and prevent electrical shocks or\n                        fires.\n                    </li>\n                    <li> <span class=\"highlight\">Fuses and circuit breakers: </span>are protective devices that are used\n                        to\n                        interrupt the flow of electrical current\n                        in a circuit\n                        when the current exceeds a certain level. Fuses are designed to melt or \"blow\" when the current\n                        exceeds a\n                        certain level,\n                        while circuit breakers use a mechanical switch to interrupt the current. Circuit breakers can be\n                        reset after\n                        they have\n                        tripped, while fuses must be replaced.</li>\n                    <li><span class=\"highlight\">Earth leakage and residual current circuit breakers (RCCBs): </span>Pare\n                        protective devices that are designed to\n                        detect and\n                        interrupt the flow of electrical current in a circuit when it is flowing to the earth or ground.\n                        These\n                        devices are\n                        commonly used to protect against electrical shocks and can be used in both residential and\n                        commercial\n                        settings.</li>\n                </div>\n            </div>\n        </div>\n\n               <div>\n            <h2 class=\"subtopic\">Safety</h2>\n            <p>Safety is the freedom from conditions that can cause death, injury, occupational illness, damage to or\n                loss of equipment\n                or property, or damage to the environment. It involves managing complexity and ensuring completeness and\n                consistency in\n                order to reduce the risk of accidents or incidents. Safety = Managing complexity without going crazy and\n                ensuring completeness and consistency.</p>\n\n\n            <h2 class=\"segueing\">Safty signs</h2>\n            <p>Safety signs are an important part of any workplace safety program, as they help to inform workers about\n                potential hazards and the steps they should take to protect themselves. There are four main types of\n                safety\n                signs:</p>\n\n            <li><span class=\"highlight\">Warning signs: </span> These signs are used to alert workers to potential\n                hazards\n                and to caution them to take\n                appropriate precautions. Warning signs may include symbols such as a triangle with an exclamation mark\n                or a\n                yellow triangle with a black border.</li>\n\n            <li><span class=\"highlight\">Advisory signs:</span> These signs provide information or guidance to workers\n                about\n                specific actions they should take\n                to protect themselves. Advisory signs may include symbols such as a <span class=\"highlight\">blue</span> circle with a white triangle or\n                a\n                green\n                circle with a white symbol.\n            </li>\n            <li><span class=\"highlight\">Mandatory signs: </span> These signs indicate that a specific action or behavior\n                is\n                required by law or company policy.\n                Mandatory signs may include symbols such as a white circle with a blue border or a red circle with a\n                white\n                symbol.</li>\n            <li><span class=\"highlight\">Prohibition signs: </span> These signs indicate that a specific action or\n                behavior\n                is prohibited and must not be done.\n                Prohibition signs may include symbols such as a red circle with a diagonal line through it or a red\n                circle\n                with\n                a white diagonal line through it.</li>\n\n\n            <p>It is important for workers to be familiar with the meaning of different safety signs and to follow the\n                instructions they provide in order to protect themselves and others from potential hazards.</p>\n\n            <div class=\" \">\n                <img class=\"img\" src=\"/allsigns.png\" />\n            </div>\n        </div>\n\n<h2 class=\"subtopic\">Electrical Safety</h2>\n        <p>Electrical accidents can have serious and potentially fatal consequences, including shock, burn, fire, and\n            explosion.\n            These types of accidents can range from electrocutions (deaths from electric shock) to minor burn injuries.\n            Fires and\n            explosions are among the most dangerous and destructive types of electrical accidents, and they can be\n            caused by a\n            variety of factors, including faulty wiring, overloaded circuits, and short circuits.</p>\n\n        <p>Electrical hazards can pose serious risks to people and property, and it is important to take steps to\n            protect against them. Examples of electrical hazards include</p>\n        <li>Contacts with live parts</li>\n        <li>Fire and explosion from faults</li>\n        <li>Electrical shock</li>\n        <li>Electrical shock drowning</li>\n        <li>Electrical contamination</li>\n        <li>Falls</li>\n        <li>Electrical overloading</li>\n        <li>Electrical arc flash</li>\n        <li>Burns</li>\n        <li>Inproper electrical grounding</li>\n        <p>To prevent electrical accidents and protect against these hazards, it is important to follow proper safety\n            procedures and to use electrical equipment and systems correctly.\n            This includes\n            using protective equipment, such as gloves and safety glasses, and following proper wiring and installation\n            techniques.\n            It is also important to regularly inspect and maintain electrical systems to ensure that they are in good\n            working order.\n            By taking these precautions, it is possible to reduce the risk of electrical accidents and protect against\n            the potential\n            risks of shock, burn, fire, and explosion.</p>\n\n        <div>\n            <p>Electrical work is subject to a number of legal requirements and industry-specific regulations and\n                guidelines that are\n                designed to ensure the safety of workers and others in the vicinity of the work. Some examples of these\n                include:</p>\n\n            <li><span class=\"highlight\">The Health and Safety at Work Act (HSW): </span> This Act is applicable to\n                everyone at work, except those in domestic\n                employment, and it also protects others in the vicinity of the work. The HSW sets out the general duties\n                of employers\n                and employees to ensure the health and safety of workers and others.</li>\n\n            <li><span class=\"highlight\">Personal Protective Equipment (PPE) Regulations: </span> These regulations set\n                out the requirements for the use of personal\n                protective equipment (PPE) in the workplace. PPE includes items such as gloves, safety glasses, and hard\n                hats, which are\n                used to protect workers from potential hazards.</li>\n\n            <li><span class=\"highlight\">Nigerian Electricity Regulatory Commission: </span>This commission is\n                responsible for regulating the electricity industry in\n                Nigeria, including the safety of electrical work.</li>\n\n            <li><span class=\"highlight\">Health and Safety Executive (HSE): </span>In some jurisdictions, such as the UK,\n                the HSE is responsible for enforcing safety\n                legislation and regulations, including those related to electrical work.</li>\n\n            <li><span class=\"highlight\">The Institution of Electrical Engineers (IEE) Wiring Regulations: </span>These\n                regulations, also known as the Requirements for\n                Electrical Installations (BS 7671), are considered the \"electrician's bible\" and form the basis of\n                electrical design,\n                calculations, and installation methods. They relate primarily to the design, selection, erection,\n                inspection, and\n                testing of electrical installations.</li>\n\n             \n        </div>\n\n        "
    },
    {
      "topic": "DESIGN AND INSTALLATION OF TELECOMMUNICATION MASTS AND TOWERS",
      "details": "\n              <div>\n                <div>\n                <h1 class=\"subtopic\">Types of Tower</h1>\n                <div>\n                    <h1 class=\"segueing\">Monopole tower or Post masts</h1>\n                    <p>\n                        Monopole towers are made of tapered steel tubes that fit together to form a\n                        stable pole. They can be self-supported or guyed and may have climbing rungs.\n                        The sections of the tower should be made of heavy duty steel or low-alloy\n                        high-strength steel, and the joints should be designed to have a minimum overlap\n                        of 1.5 times the pole diameter. The pipes should be tapered and made of\n                        galvanized steel, and the tower can be designed with a variety of configurations\n                        and finishes to meet local aesthetic requirements. The depth of the overlap, the\n                        base width, and the number of pipes in the tower are determined based on the\n                        expected height of the tower, the thickness of the pipe walls, the base\n                        diameter, and whether the tower will be guyed or self-supported.\n                    </p>\n                    <img class=\"img\" src=\"/monopole.jpg\" alt=\"\" />\n                </div>\n                <div>\n                    <h1 class=\"segueing\">Guyed towers</h1>\n                    <p>\n                        Guyed towers are structures that are supported and stabilized by tethered wires.\n                        They may be constructed in various forms, such as lattice, triangular or square,\n                        tapered or straight, or monopole. When installing guyed towers, it is important\n                        to use pre-stretched steel for the guy ropes and to avoid over-tightening the\n                        wires in order to prevent alignment issues, cable rupture, and permanent\n                        wrapping of tower structural parts. The strength of the guy wires must be\n                        sufficient to withstand the maximum tension that is likely to occur under the\n                        worst loading conditions.\n                    </p>\n                    <img class=\"img\" src=\"/guyedtower.jpg\" alt=\"\" />\n                </div>\n                <div>\n                    <h1 class=\"segueing\">Self Supporting Tower</h1>\n                    <p>\n                        Self-supporting towers are structures that are able to stand on their own\n                        without the need for additional support, such as guy wires. These towers are\n                        typically made in the form of a lattice structure, with a triangular or square\n                        shape. The legs of the tower may be made of tube, angle, lattice, or solid round\n                        materials, and the sections may be made of steel angles or steel tubes. The\n                        tower may also feature steel angle cross bracing and tapered sections, with face\n                        widths that vary according to the tower's height and load capacity. Rest\n                        platforms should be provided at intervals of 20 meters, and work platforms\n                        should be provided at all heights where antennas are to be installed. The tower\n                        should also be equipped with a climbing ladder.\n                    </p>\n                    <img class=\"img\" src=\"/selfsupporting.jpg\" alt=\"\" />\n                </div>\n                <div>\n                    <h1 class=\"segueing\">Roof mount towers</h1>\n                    <p>\n                        Roof mounts are structures that are installed on top of roofs for the purpose of elevating\n                        signals\n                        above potential\n                        interferences or obstructions. They should be designed and installed according to the following\n                        guidelines:\n                    </p>\n                    <ul>\n                        <li>Structural checks must be performed to ensure the chosen roof can withstand the additional\n                            load\n                            imposed by the structure\n                            and antenna array.</li>\n                        <li>Roof mounts should be certified by a structural engineer before installation.</li>\n                        <li>They should generally be limited to lightweight structures of low height and minimal dead\n                            and\n                            dynamic loads.</li>\n                        <li>They can be installed in either a penetrating or non-penetrating mode, and can be\n                            self-supporting or guyed.\n                            Non-penetrating roof mounts are best suited for flat surfaces.</li>\n                    </ul>\n                    <img class=\"img\" src=\"/roofmount.jpg\" alt=\"\" />\n                </div>\n            </div>\n            <br>\n            <div>\n                <h1 class=\"subtopic\">Considerations for Siting of Towers and Masts</h1>\n                <ul>\n\n                    <li>The siting of towers and masts should minimize their number, protect public safety, and mitigate\n                        visual impacts on the\n                        community.</li>\n                    <li>Stealth and/or camouflage design is encouraged.</li>\n                    <li>Towers and masts in cities should conform to Commission guidelines and standards regarding radio\n                        frequency.</li>\n                    <li>Towers in residential areas should be sited to mitigate heat, smoke, and noise pollution from\n                        generators.</li>\n                    <li>Telecommunications towers over 25 meters in height are not allowed in districts designated as\n                        residential.</li>\n                    <li>Towers over 25 meters in height should be placed at least 5 meters from the nearest property,\n                        with\n                        permission from the\n                        supervising Commission.</li>\n                    <li>Towers and masts sited in violation of these guidelines may be removed with penalty by the\n                        vising Commission.</li>\n                </ul>\n            </div>\n\n                    <div>\n            <h2 class=\"subtopic\">Design and Construction Considerations</h2>\n            <div>\n                <h2 class=\"segueing\">Superstructure</h2>\n                <p>The superstructure of towers and masts should be made from steel or aluminum materials that are\n                    hot-dip galvanized and\n                    painted according to the Nigerian Airspace Management Agency's paint schedule for obstructions.</p>\n            </div>\n            <div>\n                <h2 class=\"segueing\">Obstruction Lighting</h2>\n                <p>Obstruction lighting is required for all mast and tower structures in Nigeria. According to\n                    International Civil Aviation\n                    Organization (ICAO) and Nigerian Airspace Management Agency (NAMA) guidelines, each tower with a\n                    height of fifty meters\n                    or more above ground level must have one lamp installed at the top and two lamps installed on the\n                    sides. Obstruction\n                    lamps must be maintained in working condition at all times for structures located within 15\n                    kilometers of an airport or\n                    helipad.\n                    Light intensity and colour specifications should be as provided:\n                <table>\n                    <thead>\n\n                        <tr>\n                            <th>Tower Height</th>\n                            <th>Light Intensity</th>\n                            <th>Light Colour</th>\n                        </tr>\n\n                    </thead>\n                    <tbody>\n                        <tr>\n                            <td>Below 45m</td>\n                            <td>Not below 10 candelas</td>\n                            <td>Red and Fixed</td>\n                        </tr>\n                        <tr>\n                            <td>Between 45m and 150m</td>\n                            <td>Not below 1600 candelas</td>\n                            <td>Red and flashing</td>\n                        </tr>\n                        <tr>\n                            <td>Greater than 150m</td>\n                            <td>4000-20000 candelas</td>\n                            <td>White and flashing</td>\n                        </tr>\n                    </tbody>\n                </table>\n                </p>\n            </div>\n            <div>\n                <h2 class=\"segueing\">Substructure</h2>\n                <p>The substructure of towers and masts must be designed to withstand the full expected dynamic loads,\n                    including antennae,\n                    feeders, and wind loading. There are several types of foundations that may be used, including\n                    standard foundations, raft\n                    foundations, pile foundations, and drilled foundations.</p>\n            </div>\n            <div>\n                <h2 class=\"segueing\">Safety Devices for Towers and Masts</h2>\n                <p>Safety devices, including fall arrest systems, climbing ladders or step bolts, guard rails, work/test\n                    platforms, rest\n                    platforms, and anti-climb systems, should be installed on towers above 45 meters in height to ensure\n                    the safety of\n                    personnel.</p>\n            </div>\n            <div>\n                <h2 class=\"segueing\">Earthing and Lighting Protection of Towers and MastsGeneral</h2>\n                <p>The grounding and lightning protection of towers and masts is important for ensuring the safety of\n                    personnel and\n                    equipment. All masts should be grounded, with the earth resistance at the terminal block measuring\n                    less than 2 ohms. A\n                    lightning air terminal should be placed at the top of the mast, and a copper earth wire or tape\n                    should be run down the\n                    side of one mast leg and connected to the earth at the terminal box. It is important to use\n                    high-quality materials for\n                    the installation of earthing systems.</p>\n\n                <div>\n                    <h2 class=\"subtopic\">Earth Electrode Resistance</h2>\n                    <div>\n                        <h2 class=\"segueing\">Plate grounding</h2>\n                        $$ R = \\frac{\\rho}{4} \\sqrt{\\frac{\\pi}{A}} $$\n                        <p>where ρ = resistivity of soil, considered uniform in Ω m. A = area of each side of the\n                            plate\n                            in m2\n                            .\n                        </p>\n                    </div>\n\n                    <div>\n                        <h2 class=\"segueing\">Pipe or rod grounding :</h2>\n                        <p>\n                            The Ground Resistance (R) of a single rod, of diameter (d) and driven length (i) driven\n                            vertically into the soil of resistivity (ρ), can be calculated as follows In this case, the\n                            approximate resistance to\n                            ground in a uniform soil can be expressed by:\n\n                        </p>\n                        $$ R = \\frac{p}{2\\pi l}[\\ln\\left(\\frac{8l}{d}\\right) - 1] $$\n                    </div>\n\n                    <div>\n                        <h2 class=\"subtopic\">Tutorial</h2>\n\n                        <div>\n                            <li>Find the resistance to ground for a 600 mm by 600 mm plate grounding, considering a\n                                sandy\n                                soil, treated artificially\n                                and having attained an average soil resistivity of 10 Ωm. Compare the result if the\n                                plate is\n                                replaced with another plate\n                                grounding1200 mm by 1200 mm\n                            </li>\n                            <p>Sol</p>\n                            $$ 600mm $$\n\n                            $$ R = \\frac{\\rho}{4} \\sqrt{\\frac{\\pi}{A}} $$\n                            $$ 600mm = 0.6m $$\n                            $$ R = \\frac{10}{4} \\sqrt{\\frac{3.14}{2 \\times 0.6 \\times 0.6}} $$\n                            $$ R = 5.22Ω $$\n                            <br>\n                            $$ 1200mm $$\n                            $$ R = \\frac{\\rho}{4} \\sqrt{\\frac{\\pi}{A}} $$\n                            $$ 1200mm = 1.2m $$\n                            $$ R = \\frac{10}{4} \\sqrt{\\frac{3.14}{2 \\times 1.2 \\times 1.2}} $$\n                            $$ R = 2.61Ω $$\n\n                        </div>\n\n                        <div>\n                            <li>Find the resistance to ground of a 19 mm internal diameter pipe, 2.44 m long, with ρ as\n                                10 Ω m\n                            </li>\n                            <p>Sol</p>\n                            $$ R = \\frac{p}{2\\pi l}[\\ln\\left(\\frac{8l}{d}\\right) - 1] $$\n                            $$ 19mm = 0.019m $$\n                            $$ R = \\frac{10}{2\\pi \\times 2.44}[\\ln\\left(\\frac{8 \\times 2.44}{0.019}\\right) - 1] $$\n                            $$ R = 3.89Ω $$\n                        </div>\n                    </div>\n                </div>\n            </div>\n        </div>\n\n        <div>\n            <h1 class=\"subtopic\">Maintenance and Testing</h1>\n\n\n            <div>\n                <h2 class=\"segueing\">First Line Maintenance</h2>\n                <p>During first line maintenance, it is important to consider the potential for mechanical failure due\n                    to\n                    stress, overload,\n                    defective materials, fatigue, corrosion, poor workmanship, insufficient maintenance, sabotage, or\n                    any\n                    combination of\n                    these factors. The design of the tower should anticipate and address these potential issues in order\n                    to\n                    prevent\n                    mechanical failure.</p>\n            </div>\n            <div>\n                <h2 class=\"segueing\">Hot Dip Galvanization</h2>\n                <p>Hot dip galvanization is a process that involves dipping steel in melted zinc at a high temperature\n                    in order to protect\n                    the steel from corrosion and environmental factors such as rain, salty air, and extreme\n                    temperatures. This process\n                    involves the formation of an alloy where pure zinc is prevalent on the surface of the steel. Hot dip\n                    galvanization is an\n                    effective way to prevent the transformation of steel back to its natural state of iron, which is not\n                    suitable for\n                    structures like towers.</p>\n            </div>\n            <div>\n                <h2 class=\"segueing\">Towers Maintenance</h2>\n                <p>Towers require regular maintenance to prevent breakdowns and maintain public safety, network\n                    availability, and aesthetic\n                    appearance. Maintenance should be carried out by the owner on a routine basis and major inspections\n                    should be performed\n                    every 3 years for guyed towers and every 5 years for self-supporting towers. Shorter inspection\n                    intervals are required\n                    in certain environments such as coastal areas or corrosive atmospheres. Only authorized and\n                    experienced personnel should\n                    perform ground and aerial procedures. All structures should be inspected after severe wind events\n                    and after the\n                    installation of additional loads.</p>\n            </div>\n        </div>\n\n        <div>\n            <h1 class=\"subtopic\">Environmental Requirements</h1>\n            <div>\n                <h2 class=\"segueing\">Height</h2>\n                <p>The maximum height for a telecommunication tower is 150 meters, but a tower exceeding this height may\n                    be approved by the\n                    Commission if it does not negatively impact public health, safety, the neighborhood, the area's\n                    plan, or compliance with\n                    other laws or guidelines.</p>\n            </div>\n            <div>\n                <h2 class=\"segueing\">Tower to Tower Spacing</h2>\n                <p>The minimum distance between towers over 55 meters in height is 1 kilometer and towers should not be\n                    located near high\n                    voltage electrical power transmission lines, with the minimum distance being 120% of the tower's\n                    height.</p>\n            </div>\n            <div>\n                <h2 class=\"segueing\">Screening</h2>\n                <p>Towers and masts must be screened with a 2.5 meter tall opaque screen, and may include landscaping.\n                    The requirement for\n                    screening may be waived if the design of the tower is compatible with adjacent land uses. Barbed\n                    wire or other security\n                    fencing material may be allowed.</p>\n            </div>\n            <div>\n                <h2 class=\"segueing\">Removal of abandoned towers\n                </h2>\n                <p>A tower that has not been used for a continuous period of three years may be considered abandoned and\n                    the owner may be\n                    required to dismantle and remove it from the property within 90 days of receiving notice from the\n                    commission. If the\n                    tower is not removed within this time period, the commission may remove it and the owner may be\n                    required to pay the\n                    removal costs and a minimum penalty of 250,000 naira.</p>\n            </div>\n        </div>\n        </div>\n      "
    },
    {
      "topic": "ELECTRICAL INSTALLATION DESIGN"
    }
  ]
}
